Terraform plan for __staging__
<details>
  <summary>Plan: 3 to add, 2 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudfoundry_service.k8s will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "k8s"  {
      ~ id                  = "************************************" -> (known after apply)
        name                = "aws-eks-service"
      ~ service_broker_name = "ssb-gsa-datagov-management-staging" -> (known after apply)
      ~ service_plans       = {
          - "raw" = "8d0b0664-8c1f-4918-9b8d-ad50ac49ecd9"
        } -> (known after apply)
    }

  # cloudfoundry_service_instance.k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "k8s_cluster" {
      + id               = (known after apply)
      + name             = "ssb-k8s"
      + recursive_delete = false
      + service_plan     = (known after apply)
      + space            = "5edc803e-3376-4788-b72c-a152f11925b0"
      + tags             = [
          + "k8s",
        ]

      + timeouts {
          + create = "30m"
        }
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh           = true -> false
        id                   = "72c879c8-8cca-467a-a3d6-b236bd73458d"
      ~ id_bg                = "************************************" -> (known after apply)
        name                 = "ssb-eks"
      ~ source_code_hash     = "QUjLondRNtxdyyf6y2Tc+T5h1HuVoSJZSS3KTd71C6g=" -> "DKetx1IGWPNm6T1eUjCmUg6JUEeRpjBMSENNv9cuepg="
        # (15 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
        id                               = "54d82b92-0cb4-4fe4-bf52-287aa18d5e79"
      ~ name                             = "ssb-gsa-datagov-management-staging" -> "ssb-ssb-eks-gsa-datagov-management-staging"
        # (9 unchanged attributes hidden)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-solr"
      + path                       = "./app-ssb-solr.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "RrwYpMoh/xKGoHOwyE8XYO3+Ef1OCBgQow1ZUZ/qeN8="
      + space                      = "5edc803e-3376-4788-b72c-a152f11925b0"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = "719847d8-0328-4e83-b64e-d1ed75f42089"
        }

      + service_binding {
          + service_instance = "600ad7b8-cd84-4577-a1fc-763b8473ffda"
        }
      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-management-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "5edc803e-3376-4788-b72c-a152f11925b0"
      + url                              = "https://ssb-new-weevil.app.cloud.gov"
      + username                         = "574c0d1b-a6ba-4adb-73cc-67f256eebf6c"
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```
</details>

Plan generated in [plan #13](https://github.com/GSA/datagov-ssb/actions/runs/664810151)